---
kind: type
id: T:Autodesk.Revit.DB.ViewDisplayModel
source: html/9864e320-a160-dd24-23f6-a30c482a8e5f.htm
---
# Autodesk.Revit.DB.ViewDisplayModel

Represents the settings for displaying model graphics.
 version 2: m_showHiddenLines type changed bool -> ShowHiddenLinesValues::Enum

## Syntax (C#)
```csharp
public class ViewDisplayModel : IDisposable
```